<?php
include 'form.php';
?>
<h3>
    Завдання 5: Завантаження файлів на сервер
</h3>
<p>
    Модифікуйте даний скрипт наступним чином:
</p>
<ul>
    <li>
        Створити підпапки /images та /docs в папці uploads (виконано)
    </li>
    <li>
        Додайте можливість завантаження файлів з розширенням <b>.txt, .doc, .docx, .pdf</b> та <b>.jpg, .jpeg, .png,
            .gif </b>(виконано)
    </li>
    <li>
        Картинки зберігати в папці /images, а документи в папці /docs (виконано)
    </li>
    <li>
        Виведіть список файлів, які знаходяться в папці <b>uploads</b> та підпапках /images та /docs (виведено всі файли, ті, що і в субпапках, і просто папках)
    </li>
    <li>
        Змініть форму додавши input для надання назви файлу (виконано)
    </li>
    <li>
        Додайте до назви файлу дату та час завантаження, наприклад: <b>file_2020-12-31_23-59-59.jpg </b>(виконано)
    </li>
    <li>
        Додайте можливість видалення файлів через GET параметр <b>file</b> (виконано, просто введіть URL)
    </li>
</ul>
